def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами a,b
    Параметры:
        a (float) - первая сторона
        b (float) - вторая сторона
    Возвращаемое значение:
        a * b (float) - площадь
    Пример вызова:
    input: 2, 4
    output: 8
    '''
    return a * b
    
def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами a,b
    Параметры:
        a (float) - первая сторона
        b (float) - вторая сторона
    Возвращаемое значение:
        (a + b) * 2 (float) - периметр
    Пример вызова:
    input: 1 4
    output: 10
    '''
    return 2 * (a + b)
