def area(a):
    '''
    Возвращает площадь квадрата со стороной a
    Параметры:
        a (float) - сторона
    Возвращаемое значение:
        a * a (float) - площадь
    Пример вызова:
    input: area(2)
    output: 4
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a
    Параметры:
        a (float) - сторона
    Возвращаемое значение:
        4 * a (float) - периметр
    Пример вызова:
    input: perimeter(3)
    output: 12
    '''
    return 4 * a
