def area(a, h):
    '''
    Возвращает площадь треугольника со стороной a и высотой h
    Параметры:
        a (float) - сторона
        h (float) - высота
    Возвращаемое значение:
        a * h / 2 (float) - площадь
    Пример вызова:
    input: 2 3
    output: 3        
    '''
    return a * h / 2
    
def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника со сторонами a, b, c
    Параметры:
        a (float) - первая сторона
        b (float) - вторая сторона
        c (float) - третья сторона
    Возвращаемое значение:
        a + b + c (float) - периметр
    Пример вызова:
    input: 2 3 4
    output: 9
    '''
    return a + b + c
